app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Learn to Stink"], ["room_number", 69], ["created_at", "2021-02-16 21:39:56.096180"], ["updated_at", "2021-02-16 21:39:56.096180"]]
---
  def create
    @school_class = SchoolClass.new(school_class_params)

    respond_to do |format|
      if @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_school_class
    @school_class = SchoolClass.find(params[:id])