app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def index
    @students = Student.all

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Stink"], ["last_name", "Stonk"], ["created_at", "2021-02-16 21:54:54.983250"], ["updated_at", "2021-02-16 21:54:54.983250"]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_student
    @student = Student.find(params[:id])